app/Controllers/JenisBarang.php

  public function index()
  {
    $data = $this->JenisBarangModel->findAll();
---
SELECT *
FROM `jenis_barang`

  public function show($id = null)
  {
    $data = $this->JenisBarangModel->where('id', $id)->first();
---
SELECT *
FROM `jenis_barang`
WHERE `id` = '2'
 LIMIT 1

  public function create()
  {
    $data = [
      'nama' => $this->request->getVar('nama'),
    ];

    $this->JenisBarangModel->insert($data);
---
INSERT INTO `jenis_barang` (`nama`) VALUES ('Konsumsi')

  public function delete($id = null)
  {
    $data = $this->JenisBarangModel->find($id);
---
SELECT *
FROM `jenis_barang`
WHERE `jenis_barang`.`id` = '31'