app/Controllers/Produks.php

  public function index()
  {
    $data = $this->ProdukModel->findAll();
---
SELECT *
FROM `produk`